#+STARTUP: folded indent inlineimages latexpreview
#+PROPERTY: header-args:R :results output :session *R:crayon*

* ~{crayon}~: R package for colored terminal output                  :noexport:

~{crayon}~ (クレヨン) は、R のコンソール出力を色付けするパッケージ。
\\

* 目次                                                            :quote:toc:
#+BEGIN_QUOTE
- [[#ライブラリの読み込みとバージョンの確認][ライブラリの読み込みとバージョンの確認]]
- [[#利用法][利用法]]
  - [[#基本][基本]]
  - [[#スタイル][スタイル]]
  - [[#文字の色][文字の色]]
  - [[#背景の色][背景の色]]
- [[#実行環境][実行環境]]
- [[#参考リンク][参考リンク]]
#+END_QUOTE

* ライブラリの読み込みとバージョンの確認

#+begin_src R :results silent
library(crayon)
#+end_src
\\

- バージョン
#+begin_src R :exports both
packageVersion("crayon")
#+end_src

#+RESULTS:
: [1] ‘1.3.4’
\\

* 利用法
** 基本

- コンソール出力に書式をつけるパッケージ
#+begin_src R :exports both
cat(blue("Hello", "world!\n"))
#+end_src

#+RESULTS:
: Hello world!
\\

- %+% で異なる書式の文字列を連結
#+begin_src R :exports both
cat("... to highlight the " %+% red("search term") %+% " in a block of text\n")
#+end_src

#+RESULTS:
: ... to highlight the search term in a block of text
\\

- $ で書式を追加
#+begin_src R :exports both
cat(yellow$bgMagenta$bold('Hello world!\n'))
#+end_src

#+RESULTS:
: Hello world!
\\

- 書式をネストできる
#+begin_src R :exports both
cat(green(
  'I am a green line ' %+%
  blue$underline$bold('with a blue substring') %+%
  ' that becomes green again!\n'
))
#+end_src

#+RESULTS:
: 
: I am a green line with a blue substring that becomes green again!
\\

- テンプレートとして書式を設定
#+begin_src R :exports both
error <- red $ bold
warn  <- magenta $ underline
note  <- cyan

cat(error("Error: subscript out of bounds!\n"))
cat(warn("Warning: shorter argument was recycled.\n"))
cat(note("Note: no such directory.\n"))
#+end_src

#+RESULTS:
: 
: Error: subscript out of bounds!
: Warning: shorter argument was recycled.
: Note: no such directory.
\\

** スタイル

- reset
- bold
- blurred (usually called dim, renamed to avoid name clash)
- italic (not widely supported)
- underline
- inverse
- hidden
- strikethrough (not widely supported)

** 文字の色

- black
- red
- green
- yellow
- blue
- magenta
- cyan
- white
- silver (usually called gray, renamed to avoid name clash)

** 背景の色

- bgBlack
- bgRed
- bgGreen
- bgYellow
- bgBlue
- bgMagenta
- bgCyan
- bgWhite

* 実行環境

#+begin_src R :results output :exports both
sessionInfo()
#+end_src

#+RESULTS:
#+begin_example
R version 3.6.1 (2019-07-05)
Platform: x86_64-pc-linux-gnu (64-bit)
Running under: Ubuntu 18.04.3 LTS

Matrix products: default
BLAS:   /usr/lib/x86_64-linux-gnu/blas/libblas.so.3.7.1
LAPACK: /usr/lib/x86_64-linux-gnu/lapack/liblapack.so.3.7.1

locale:
 [1] LC_CTYPE=en_US.UTF-8       LC_NUMERIC=C              
 [3] LC_TIME=en_US.UTF-8        LC_COLLATE=en_US.UTF-8    
 [5] LC_MONETARY=en_US.UTF-8    LC_MESSAGES=en_US.UTF-8   
 [7] LC_PAPER=en_US.UTF-8       LC_NAME=C                 
 [9] LC_ADDRESS=C               LC_TELEPHONE=C            
[11] LC_MEASUREMENT=en_US.UTF-8 LC_IDENTIFICATION=C       

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
[1] dplyr_0.8.3  magrittr_1.5 crayon_1.3.4 glue_1.3.1  

loaded via a namespace (and not attached):
 [1] Rcpp_1.0.2       tidyselect_0.2.5 bit_1.1-14       R6_2.4.0        
 [5] rlang_0.4.0      fansi_0.4.0      blob_1.2.0       tools_3.6.1     
 [9] pacman_0.5.1     utf8_1.1.4       cli_1.1.0        DBI_1.0.0       
[13] bit64_0.9-7      digest_0.6.21    assertthat_0.2.1 tibble_2.1.3    
[17] purrr_0.3.2      vctrs_0.2.0      zeallot_0.1.0    memoise_1.1.0   
[21] RSQLite_2.1.2    compiler_3.6.1   pillar_1.4.2     backports_1.1.5 
[25] pkgconfig_2.0.3
#+end_example
\\

* 参考リンク

- [[https://cran.r-project.org/web/packages/crayon/index.html][CRAN]]
- [[https://cran.r-project.org/web/packages/crayon/crayon.pdf][Reference Manual]]
- [[https://github.com/r-lib/crayon][Github Repo]]
